test/request-response-samples/GetOrderList__should_properly_set_the_namespace_of_deep_complex_types/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:tns="http://api.somecompany.com/webservices/" xmlns:s1="http://api.somecompany.com/datacontracts/orders"><soap:Header></soap:Header><soap:Body><tns:GetOrderList xmlns:tns="http://api.somecompany.com/webservices/" xmlns="http://api.somecompany.com/webservices/"><tns:accountID>account-id</tns:accountID><tns:orderCriteria><s1:DetailLevel xmlns:s1="http://api.somecompany.com/datacontracts/orders">Complete</s1:DetailLevel></tns:orderCriteria></tns:GetOrderList></soap:Body></soap:Envelope>